seed_files = "#{Rails.root}/db/seed_files"
#clear uploads
FileUtils.rm_rf("#{Rails.root}/public/uploads")
#users-------------------------------------------
User.destroy_all
users = []

users << User.create!(
    :name =>'Александр',
    :patronymic =>'Дмитриевич',
    :surname =>'Админовский',
    :birthday =>'1993-02-15',
    :skype =>'admin',
    :phone =>'0992334566',
    :salary =>'2000',
    :detalies =>'',
    :avatar => File.open("#{seed_files}/avatars/1.jpg"),
    :email => 'admin@admin.com',
    :password => 'adminadmin',
    :role => 'admin'
)
users << User.create!(
    :name =>'Василий',
    :patronymic =>'Адамович',
    :surname =>'Уткин',
    :birthday =>'1990-05-11',
    :skype =>'asya@',
    :phone =>'0992334590',
    :salary =>'3000',
    :detalies =>'',
    :avatar => File.open("#{seed_files}/avatars/2.jpeg"),
    :email => 'vasya@utkin.com',
    :password => '123123123',
    :role => 'developer'
)
users << User.create!(
    :name =>'Петр',
    :patronymic =>'Сергеевич',
    :surname =>'Варешка',
    :birthday =>'1990-05-11',
    :skype =>'petr@',
    :phone =>'0978994566',
    :salary =>'3000',
    :detalies =>'',
    :avatar => File.open("#{seed_files}/avatars/3.jpg"),
    :email => 'petr@sergeevich.com',
    :password => '123123123',
    :role => 'developer'
)
users << User.create!(
    :name =>'Антон',
    :patronymic =>'Олегович',
    :surname =>'Носов',
    :birthday =>'1991-08-11',
    :skype =>'anton',
    :phone =>'099237890',
    :salary =>'3000',
    :detalies =>'',
    :avatar => File.open("#{seed_files}/avatars/4.jpg"),
    :email => 'anton@nosov.com',
    :password => '123123123',
    :role => 'developer'
)
users << User.create!(
    :name =>'Жанна',
    :patronymic =>'Семеновна',
    :surname =>'Воронина',
    :birthday =>'1989-01-01',
    :skype =>'ganna',
    :phone =>'0992309890',
    :salary =>'5000',
    :detalies =>'',
    :avatar => File.open("#{seed_files}/avatars/5.jpg"),
    :email => 'ganna@voroni.com',
    :password => '123123123',
    :role => 'manager'
)


projects = []
users.each do |user|
  1.upto(20) do |i|
    projects << project = user.own_projects.create(name: "#{user.name} project #{i}", description: "Система повинна мати користувачів. Користувачі мають бути поді-ленні на ролі(адміністратор, керівництво, менеджер, стажер).

    Адміністратор повинен мати доступ до юзерів, проектів, тасків та ма-ти можливість створювати змінювати та видаляти дані.
Керівництво повинно мати доступ до перегляду всієї інформації, та мати можливість вести звітність щодо фінансової сторони, також лише кке-рівництво може бачити статистику розвитку компанії.
Стажери можуть бачити лише таск менеджер і виконувати задачі які в них є, оцінювати і змінювати статус задачі.
Проекти мають поля(назва, опис, варіанти доступу, файли (опис, тз)). Дос-туп до проекту (публічний приватний частковий).  Зв'язок із задачами та з юзерами.
Дії з проектом:
•	 Можливість капіровать проект для кожного користувача;
•	Видалення;
•	Редагування даних.
Повідомлення на пошту, в проекті галочку стежити за проектом (під-писатися на проект) - будь-яка дія з проектом приходить на пошту
	Задачі мають поля(назва, опис, файли, статус (open closed in progres pause field), оцінка часу, дата запланованого виконнаня, дата виконання). Виконавець у задачі може бути лише один. Оцінювати задачу може викона-вець та той хто створює витрачений час на виконання (дві дати початок ви-конання і кінець час вважається і сходячи з цих дат і пауз воно накплевается навіть якщо переоцінена час і т.д).
")

    3.times{users.sample.user_to_projects.create(:project_id => project.id)}
  end
end

tasks = []
# statuses = ['opened', 'in_progress', 'paused', 'finished', 'returned', 'closed']
projects.each do |project|

    tasks << project.tasks.create(
        title: "Task.1",
        executor_id: project.users.sample.id,
        release_date: Date.today + (1..5).to_a.sample.day,
        description: "Профіль співробітника. Публічний і приватний. Публічний - анкета співробітника. Включає в себе основні дані про працівника, загальне уяв-лення, навички / технології якими володіє. Метою цього профілю являеться викликати інтерес і донести інформацію про кожного співробітника фірми.
Приватний - включає в себе публічний профіль, а так само більш детальну внутрішню інформацію про співробітника. Наприклад: заробітна плата, від-пустки, вироблені годинник і т. Д.
"
    )
    tasks << project.tasks.create(
        title: "Task.2",
        executor_id: project.users.sample.id,
        release_date: Date.today + (1..5).to_a.sample.day,
        description: "База навичок / технологій. Перелік різних можливих навичок, завдань і технологій для їх реалізації з якими розробники можуть зіткнутися під час своєї роботи. Шляхом ведення статистики (п.7) можна буде оцінювати знання розробника в його професійною сфері. Це може спростити роботу менеджера в пошуку підходящої роботи для розробника.
Визначення найбільш затребуваних навичок допоможе розробнику вибрати правильний напрямок для подальшого розвитку. Ще одна мета це взаімомотивація і обмін досвідом між розробниками - можливість створення учнів статтею (п. 1) з прив'язкою до технологій / навичкам. Тобто на основі отриманого досвіду розробник зможе описати поставлену перед ним задачу і шляхи її вирішення з зазначенням технологій які він для цього використовував.
")
    tasks << project.tasks.create(
        title: "Task.3",
        executor_id: project.users.sample.id,
        release_date: Date.today + (1..5).to_a.sample.day,
        description: "Таск менеджер. Мета цього розділу - це допомога як команді, так і кожному зі співробітників фірми поотдельности навчитися планувати і аде-кватно оцінювати своє робоче, а за бажанням і особистий час.
Кожен із співробітників може створювати розділи (далі проекти). Кожен проект має назву, опис, список завдань (далі ТАСК), свій перелік налашту-вань (доступи, права, конфігурація таск шаблону і т. Д.).
")
    tasks << project.tasks.create(
        title: "Task.4",
        executor_id: project.users.sample.id,
        release_date: Date.today + (1..5).to_a.sample.day,
        description: " Календар. Тут будуть перегляньте дні тижня і перелік завдань запла-нованих по датах. Так само в календарі є можливість різних фільтрів напри-клад по проектам і перегляді календарів інших співробітників, якщо вони дали на це доступ.")
    tasks << project.tasks.create(
        title: "Task.5",
        executor_id: project.users.sample.id,
        release_date: Date.today + (1..5).to_a.sample.day,
        description: " Фінанси - фінансовий прогрес розвитку фірми. Дані збираються на основі фінансової звітності. Ведення звітності по всіляких потоків фірми. Доходи, витрати, податки і т.д.")

end


tasks.each do |task|
  10.times{task.switch_status}
end